---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.PressureDrop
source: html/61f0cd1d-fafb-3fa3-8795-22f824ecf5f9.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.PressureDrop Property

The pressure drop of the pipe. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double PressureDrop { get; set; }
```